app/views/key_points/index.html.erb

            <% end %>
            <% if current_user.favorited_key_points.include?(key_point) %>
---
SELECT "key_points".* FROM "key_points" WHERE "key_points"."user_id" = ?  [["user_id", 2]]
SELECT 1 AS one FROM "key_points" INNER JOIN "favorites" ON "key_points"."id" = "favorites"."key_point_id" WHERE "favorites"."user_id" = ? AND "key_points"."id" = ? LIMIT ?  [["user_id", 2], ["id", 1], ["LIMIT", 1]]