app/controllers/favorites_controller.rb

SELECT "key_points".* FROM "key_points" WHERE "key_points"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_key_point
    @key_point = KeyPoint.find(params[:key_point_id])