app/controllers/key_points_controller.rb

  def create
    @key_point = current_user.key_points.new(key_point_params)
    if @key_point.save
---
INSERT INTO "key_points" ("title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", "脇を締める"], ["user_id", 2], ["created_at", "2024-10-03 07:25:33.296906"], ["updated_at", "2024-10-03 07:25:33.296906"]]

  def update
    if @key_point.update(key_point_params)
---
UPDATE "key_points" SET "title" = ?, "updated_at" = ? WHERE "key_points"."id" = ?  [["title", "脇を締めること"], ["updated_at", "2024-10-04 09:51:31.092075"], ["id", 1]]

  def destroy
    @key_point.destroy
---
DELETE FROM "key_points" WHERE "key_points"."id" = ?  [["id", 9]]

  def set_key_point
    @key_point = current_user.key_points.find(params[:id])
---
SELECT "key_points".* FROM "key_points" WHERE "key_points"."user_id" = ? AND "key_points"."id" = ? LIMIT ?  [["user_id", 2], ["id", 9], ["LIMIT", 1]]