app/controllers/practice_records_controller.rb

SELECT "practice_records".* FROM "practice_records" WHERE "practice_records"."user_id" = ? AND "practice_records"."id" = ? LIMIT ?  [["user_id", 2], ["id", 1], ["LIMIT", 1]]
---
  def set_practice_record
    @practice_record = current_user.practice_records.find(params[:id])