app/controllers/practice_records_controller.rb

UPDATE "practice_records" SET "date" = ?, "comment" = ?, "updated_at" = ? WHERE "practice_records"."id" = ?  [["date", "2024-09-27 00:00:00"], ["comment", "ミスショットが多い１日であった。今度は胸から胸を意識したい。なぜだか右に行く気がするが、これは左肩が上がっている事が原因だった\r\n"], ["updated_at", "2024-10-06 01:45:47.700987"], ["id", 2]]
---
  def update
    if @practice_record.update(practice_record_params)

DELETE FROM "practice_records" WHERE "practice_records"."id" = ?  [["id", 2]]
---
  def destroy
    @practice_record.destroy

INSERT INTO "practice_records" ("user_id", "practice_menu_id", "date", "goal", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @practice_record = current_user.practice_records.build(practice_record_params)

    if @practice_record.save

SELECT "practice_records".* FROM "practice_records" WHERE "practice_records"."user_id" = ? AND "practice_records"."id" = ? LIMIT ?  [["user_id", 2], ["id", 2], ["LIMIT", 1]]
---
  def set_practice_record
    @practice_record = current_user.practice_records.find(params[:id])