app/models/user.rb

INSERT INTO "favorites" ("user_id", "key_point_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["user_id", 2], ["key_point_id", 1], ["created_at", "2024-10-13 08:37:44.071774"], ["updated_at", "2024-10-13 08:37:44.071774"]]
---
  def favorite(key_point)
    favorited_key_points << key_point

DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]
---
  def unfavorite(key_point)
    favorited_key_points.destroy(key_point)